##  Introduction to Pandas üêº

In this section of the course, we‚Äôll explore how to use **Pandas** for effective data analysis.

Pandas is a powerful and flexible library built on top of NumPy. You can think of it as a **supercharged version of Excel**, with far more capabilities for handling, analyzing, and manipulating structured data.

---

### üóÇÔ∏è Course Flow for Pandas

To build a solid foundation, it's recommended to follow the lessons in this order:

---


#### 1) DataFrames  
- Two-dimensional labeled data structure  
- Similar to a table or spreadsheet  
- The core structure used in most data analysis tasks

---

#### 2) Handling Missing Data  
- Detecting, removing, and filling missing values  
- Important for cleaning real-world datasets

---

#### 3) GroupBy  
- Splitting data into groups and applying functions (e.g., sum, mean)  
- Very useful for aggregating and analyzing grouped data

---

#### 4) Merging, Joining, Concatenating, and Pivoting  
- Combining multiple DataFrames  
- Similar to SQL joins or Excel VLOOKUP  
- Reshaping data to suit analysis needs

---

#### 7) Operations  
- Applying functions to columns and rows  
- Descriptive statistics, sorting, filtering, etc.

---

#### 8) Data Input and Output  
- Reading and writing data from various file types  
  (CSV, Excel, SQL, JSON, etc.)

---

üß† Mastering Pandas will allow you to handle, clean, and analyze data with high efficiency and minimal code.

## DataFrames
- DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [6]:
import pandas as pd
import numpy as np

In [7]:
np.random.randn(5,4)

array([[ 0.53873965, -0.97740609, -0.08824059,  0.08631248],
       [-0.29746405, -0.46965292, -1.07403332,  0.04085747],
       [ 0.61108192, -1.59576853,  1.62169014,  1.25517745],
       [ 1.24933469,  0.21438541, -1.42440364,  0.89604652],
       [-0.2191972 ,  1.99075776,  0.36280511,  1.02194911]])

In [8]:
df = pd.DataFrame(np.random.randn(5,4), index = ['A','B','C','D','E'], columns= ['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.150270  1.312049  0.115219 -0.909691
B  0.058656 -0.086449  2.465962  0.232601
C  0.574383 -0.125091  0.863133 -2.417150
D  0.979873 -0.560238 -0.239396  0.096186
E  0.180092 -0.028268  0.131406 -0.169910

In [9]:
df2 = pd.DataFrame({'A':[1,2,3],'B':[5,6,7],'C':[1,2,3],'D':[10,20,30]})
df2

   A  B  C   D
0  1  5  1  10
1  2  6  2  20
2  3  7  3  30

## Selecting Columns

In [10]:
df

          W         X         Y         Z
A -0.150270  1.312049  0.115219 -0.909691
B  0.058656 -0.086449  2.465962  0.232601
C  0.574383 -0.125091  0.863133 -2.417150
D  0.979873 -0.560238 -0.239396  0.096186
E  0.180092 -0.028268  0.131406 -0.169910

In [11]:
df['W']

A   -0.150270
B    0.058656
C    0.574383
D    0.979873
E    0.180092
Name: W, dtype: float64

In [12]:
df[['Z','W']]

          Z         W
A -0.909691 -0.150270
B  0.232601  0.058656
C -2.417150  0.574383
D  0.096186  0.979873
E -0.169910  0.180092

## Creating a New Column

In [13]:
df['my_list'] = [20, 50, 80, 90, 70]
df

          W         X         Y         Z  my_list
A -0.150270  1.312049  0.115219 -0.909691       20
B  0.058656 -0.086449  2.465962  0.232601       50
C  0.574383 -0.125091  0.863133 -2.417150       80
D  0.979873 -0.560238 -0.239396  0.096186       90
E  0.180092 -0.028268  0.131406 -0.169910       70

In [14]:
df['my_ser'] = pd.Series([10,20,30,40,50], index=['B','A','E','D','C'])
df

          W         X         Y         Z  my_list  my_ser
A -0.150270  1.312049  0.115219 -0.909691       20      20
B  0.058656 -0.086449  2.465962  0.232601       50      10
C  0.574383 -0.125091  0.863133 -2.417150       80      50
D  0.979873 -0.560238 -0.239396  0.096186       90      40
E  0.180092 -0.028268  0.131406 -0.169910       70      30

In [15]:
df['W']+df['Y']

A   -0.035051
B    2.524618
C    1.437516
D    0.740477
E    0.311497
dtype: float64

In [16]:
df['new'] = df['W']+df['Y']

In [17]:
df

          W         X         Y         Z  my_list  my_ser       new
A -0.150270  1.312049  0.115219 -0.909691       20      20 -0.035051
B  0.058656 -0.086449  2.465962  0.232601       50      10  2.524618
C  0.574383 -0.125091  0.863133 -2.417150       80      50  1.437516
D  0.979873 -0.560238 -0.239396  0.096186       90      40  0.740477
E  0.180092 -0.028268  0.131406 -0.169910       70      30  0.311497

In [18]:
df['plus_5'] = df['my_ser'] + 5
df

          W         X         Y         Z  my_list  my_ser       new  plus_5
A -0.150270  1.312049  0.115219 -0.909691       20      20 -0.035051      25
B  0.058656 -0.086449  2.465962  0.232601       50      10  2.524618      15
C  0.574383 -0.125091  0.863133 -2.417150       80      50  1.437516      55
D  0.979873 -0.560238 -0.239396  0.096186       90      40  0.740477      45
E  0.180092 -0.028268  0.131406 -0.169910       70      30  0.311497      35

In [19]:
df['my_list'] > 80

A    False
B    False
C    False
D     True
E    False
Name: my_list, dtype: bool

## Droping Columns

In [20]:
df

          W         X         Y         Z  my_list  my_ser       new  plus_5
A -0.150270  1.312049  0.115219 -0.909691       20      20 -0.035051      25
B  0.058656 -0.086449  2.465962  0.232601       50      10  2.524618      15
C  0.574383 -0.125091  0.863133 -2.417150       80      50  1.437516      55
D  0.979873 -0.560238 -0.239396  0.096186       90      40  0.740477      45
E  0.180092 -0.028268  0.131406 -0.169910       70      30  0.311497      35

In [21]:
df.drop('new', axis=1 )
df

          W         X         Y         Z  my_list  my_ser       new  plus_5
A -0.150270  1.312049  0.115219 -0.909691       20      20 -0.035051      25
B  0.058656 -0.086449  2.465962  0.232601       50      10  2.524618      15
C  0.574383 -0.125091  0.863133 -2.417150       80      50  1.437516      55
D  0.979873 -0.560238 -0.239396  0.096186       90      40  0.740477      45
E  0.180092 -0.028268  0.131406 -0.169910       70      30  0.311497      35

In [22]:
df.drop('new', axis=1 , inplace = True )
df

          W         X         Y         Z  my_list  my_ser  plus_5
A -0.150270  1.312049  0.115219 -0.909691       20      20      25
B  0.058656 -0.086449  2.465962  0.232601       50      10      15
C  0.574383 -0.125091  0.863133 -2.417150       80      50      55
D  0.979873 -0.560238 -0.239396  0.096186       90      40      45
E  0.180092 -0.028268  0.131406 -0.169910       70      30      35

In [23]:
df.drop(['my_ser','plus_5'], axis=1 , inplace = True )
df

          W         X         Y         Z  my_list
A -0.150270  1.312049  0.115219 -0.909691       20
B  0.058656 -0.086449  2.465962  0.232601       50
C  0.574383 -0.125091  0.863133 -2.417150       80
D  0.979873 -0.560238 -0.239396  0.096186       90
E  0.180092 -0.028268  0.131406 -0.169910       70

In [24]:
df.loc['A']

W          -0.150270
X           1.312049
Y           0.115219
Z          -0.909691
my_list    20.000000
Name: A, dtype: float64

In [25]:
df.iloc[3]

W           0.979873
X          -0.560238
Y          -0.239396
Z           0.096186
my_list    90.000000
Name: D, dtype: float64

In [26]:
df.loc[['A', 'C']]

          W         X         Y         Z  my_list
A -0.150270  1.312049  0.115219 -0.909691       20
C  0.574383 -0.125091  0.863133 -2.417150       80

In [27]:
df.iloc[[3,4]]

          W         X         Y         Z  my_list
D  0.979873 -0.560238 -0.239396  0.096186       90
E  0.180092 -0.028268  0.131406 -0.169910       70

In [28]:
df.iloc[2:5]

          W         X         Y         Z  my_list
C  0.574383 -0.125091  0.863133 -2.417150       80
D  0.979873 -0.560238 -0.239396  0.096186       90
E  0.180092 -0.028268  0.131406 -0.169910       70

In [29]:
df.loc['A']['W']

np.float64(-0.1502702190451328)

## Creating a New Row

In [30]:
df

          W         X         Y         Z  my_list
A -0.150270  1.312049  0.115219 -0.909691       20
B  0.058656 -0.086449  2.465962  0.232601       50
C  0.574383 -0.125091  0.863133 -2.417150       80
D  0.979873 -0.560238 -0.239396  0.096186       90
E  0.180092 -0.028268  0.131406 -0.169910       70

In [31]:
df.loc['V'] = [10, 20, 30 ,80, 90]
df

           W          X          Y          Z  my_list
A  -0.150270   1.312049   0.115219  -0.909691       20
B   0.058656  -0.086449   2.465962   0.232601       50
C   0.574383  -0.125091   0.863133  -2.417150       80
D   0.979873  -0.560238  -0.239396   0.096186       90
E   0.180092  -0.028268   0.131406  -0.169910       70
V  10.000000  20.000000  30.000000  80.000000       90

In [32]:
df.drop('V', axis= 0, inplace=True)
df

          W         X         Y         Z  my_list
A -0.150270  1.312049  0.115219 -0.909691       20
B  0.058656 -0.086449  2.465962  0.232601       50
C  0.574383 -0.125091  0.863133 -2.417150       80
D  0.979873 -0.560238 -0.239396  0.096186       90
E  0.180092 -0.028268  0.131406 -0.169910       70

In [33]:
df[['W','X']].loc[['A','B']]

          W         X
A -0.150270  1.312049
B  0.058656 -0.086449

In [34]:
df > 0

       W      X      Y      Z  my_list
A  False   True   True  False     True
B   True  False   True   True     True
C   True  False   True  False     True
D   True  False  False   True     True
E   True  False   True  False     True

## Selecting By Data type

In [35]:
df3 = pd.DataFrame(
    {
        "integers": pd.Series([1, 2, 3], dtype=np.dtype("int32")),
        "strings": pd.Series(["x", "y", "z"], dtype=np.dtype("O")),
        "booleans": pd.Series([True, False, np.nan], dtype=np.dtype("O")),
        "strings_2": pd.Series(["h", "i", np.nan], dtype=np.dtype("O")),
        "integers_2": pd.Series([10, np.nan, 20], dtype=np.dtype("float")),
        "floats": pd.Series([np.nan, 100.5, 200], dtype=np.dtype("float")),
        "dates": pd.Series(['30/7/1993 12:26:13', '30/7/1993 12:26:13', '30/7/1993 12:26:13'], dtype=np.dtype("O"))
    }
)

In [36]:
df3

   integers strings booleans strings_2  integers_2  floats               dates
0         1       x     True         h        10.0     NaN  30/7/1993 12:26:13
1         2       y    False         i         NaN   100.5  30/7/1993 12:26:13
2         3       z      NaN       NaN        20.0   200.0  30/7/1993 12:26:13

In [37]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   integers    3 non-null      int32
 1   strings     3 non-null      object
 2   booleans    2 non-null      object
 3   strings_2   2 non-null      object
 4   integers_2  2 non-null      float64
 5   floats      2 non-null      float64
 6   dates       3 non-null      object
dtypes: float64(2), int32(1), object(4)
memory usage: 288.0+ bytes

In [38]:
df3 = df3.convert_dtypes()

In [39]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   integers    3 non-null      Int32
 1   strings     3 non-null      string
 2   booleans    2 non-null      boolean
 3   strings_2   2 non-null      string
 4   integers_2  2 non-null      Int64
 5   floats      2 non-null      Float64
 6   dates       3 non-null      string
dtypes: Float64(1), Int32(1), Int64(1), boolean(1), string(3)
memory usage: 279.0 bytes

In [40]:
df3['integers'] = df3['integers'].astype('float32')

In [41]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   integers    3 non-null      float32
 1   strings     3 non-null      string
 2   booleans    2 non-null      boolean
 3   strings_2   2 non-null      string
 4   integers_2  2 non-null      Int64
 5   floats      2 non-null      Float64
 6   dates       3 non-null      string
dtypes: Float64(1), Int64(1), boolean(1), float32(1), string(3)
memory usage: 276.0 bytes

In [42]:
df3['dates'] = pd.to_datetime(df3['dates'],format = "%d/%m/%Y %H:%M:%S" )
df3

,integers,strings,booleans,strings_2,integers_2,floats,dates
0,1.0,x,True,h,10,<NA>,1993-07-30 12:26:13
1,2.0,y,False,i,<NA>,100.5,1993-07-30 12:26:13
2,3.0,z,<NA>,<NA>,20,200.0,1993-07-30 12:26:13

In [43]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   integers    3 non-null      float32
 1   strings     3 non-null      string
 2   booleans    2 non-null      boolean
 3   strings_2   2 non-null      string
 4   integers_2  2 non-null      Int64
 5   floats      2 non-null      Float64
 6   dates       3 non-null      datetime64[ns]
dtypes: Float64(1), Int64(1), boolean(1), datetime64[ns](1), float32(1), string(2)
memory usage: 276.0 bytes

## Select with datatype

In [44]:
df3.select_dtypes(include = ['float32'])

   integers
0       1.0
1       2.0
2       3.0

In [45]:
df3.select_dtypes(include = ['bool'])

   booleans
0      True
1     False
2      <NA>

In [46]:
df3.select_dtypes(include = ['string'])

  strings strings_2
0       x         h
1       y         i
2       z      <NA>

In [47]:
df3.select_dtypes(include = ['string','datetime'])

  strings strings_2               dates
0       x         h 1993-07-30 12:26:13
1       y         i 1993-07-30 12:26:13
2       z      <NA> 1993-07-30 12:26:13

## Missing Data

In [48]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan], 'C':[1,2,3], 'D':[10,np.nan,np.nan]})

In [49]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [50]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False   True  False   True
2   True   True  False   True

In [51]:
df.isna().sum(axis= 0)

A    1
B    2
C    0
D    2
dtype: int64

In [52]:
df.isna().sum(axis= 1)

0    0
1    2
2    3
dtype: int64

In [53]:
df.dropna(axis = 0 , inplace = True)

In [54]:
df

     A    B  C     D
0  1.0  5.0  1  10.0

In [58]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan], 'C':[1,2,3], 'D':[10,np.nan,np.nan]})

## Filling Missing data

In [55]:
df

     A    B  C     D
0  1.0  5.0  1  10.0

In [56]:
df.fillna(value = 10)

     A    B  C     D
0  1.0  5.0  1  10.0

In [57]:
df

     A    B  C     D
0  1.0  5.0  1  10.0

In [58]:
df['A'].mean()

np.float64(1.0)

In [59]:
df['A'].fillna(value = df['A'].mean(), inplace = True)
df

C:\Users\Admin\AppData\Local\Temp\ipykernel_1644\4028766332.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['A'].fillna(value = df['A'].mean(), inplace = True)

     A    B  C     D
0  1.0  5.0  1  10.0

In [60]:
df.fillna(value = df['A'].mean(), inplace = True)
df

     A    B  C     D
0  1.0  5.0  1  10.0

In [61]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## Operations

In [62]:
df = pd.DataFrame({'col1':[1,5,3,2,4],'col2':[444,222,666,444,555],'col3':['abc','xyz','ijklmn','xyz', 'defgh']})

In [63]:
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [64]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [65]:
# Unique
df['col2'].unique()

array([444, 222, 666, 555])

In [66]:
df['col2'].nunique()

4

In [67]:
# Values_count
df['col3'].value_counts()

col3
xyz       2
abc       1
ijklmn    1
defgh     1
Name: count, dtype: int64

In [68]:
# Sort_values
df.sort_values(by= 'col2')

   col1  col2    col3
1     5   222     xyz
0     1   444     abc
3     2   444     xyz
4     4   555   defgh
2     3   666  ijklmn

In [69]:
df.sort_values(by= 'col2', ascending = False)

   col1  col2    col3
2     3   666  ijklmn
4     4   555   defgh
0     1   444     abc
3     2   444     xyz
1     5   222     xyz

In [70]:
df

   col1  col2    col3
0     1   444     abc
1     5   222     xyz
2     3   666  ijklmn
3     2   444     xyz
4     4   555   defgh

In [71]:
df['col2'].mean()

np.float64(466.2)

In [72]:
df = pd.DataFrame({'col1':[1,2,3,np.nan, 4, 5, 6],
                   'col2':[np.nan,555,666,444, 4, 5, 6],
                   'col3':['abc','def','ghi','xyz', 4, 5, 6],
                   'col4':['abc','def','ghi','xyz', 4, 5, 6],
                   'col5':['abc','def','ghi','xyz', 4, 5, 6]})
df

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi
3   NaN  444.0  xyz  xyz  xyz
4   4.0    4.0    4    4    4
5   5.0    5.0    5    5    5
6   6.0    6.0    6    6    6

In [73]:
# head
df.head(3)

   col1   col2 col3 col4 col5
0   1.0    NaN  abc  abc  abc
1   2.0  555.0  def  def  def
2   3.0  666.0  ghi  ghi  ghi

In [74]:
# tail
df.tail(2)

   col1  col2 col3 col4 col5
5   5.0   5.0    5    5    5
6   6.0   6.0    6    6    6

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    6 non-null      float64
 1   col2    6 non-null      float64
 2   col3    7 non-null      object
 3   col4    7 non-null      object
 4   col5    7 non-null      object
dtypes: float64(2), object(3)
memory usage: 412.0+ bytes

In [76]:
df.describe()

           col1        col2
count  6.000000    6.000000
mean   3.500000  280.000000
std    1.870829  309.319899
min    1.000000    4.000000
25%    2.250000    5.250000
50%    3.500000  225.000000
75%    4.750000  527.250000
max    6.000000  666.000000

In [77]:


data = {
    'Name': ['Ahmed', 'Noha', 'Maha', 'Fady'],
    'Age': [np.nan, 18, 20, 21],
    'City': [np.nan, "Cairo", "Cairo", "Cairo"]
}

zo = pd.DataFrame(data)
zo

    Name   Age   City
0  Ahmed   NaN    NaN
1   Noha  18.0  Cairo
2   Maha  20.0  Cairo
3   Fady  21.0  Cairo

In [ ]:


data = {
    'Name': ["Ahmed", "Noha", "Maha", "Fady"],
    'Age': [np.nan, 18, 20, 21],
    'City': [np.nan, "Cairo", "Cairo", "Cairo"]
}

df = pd.DataFrame(data)


print(df)

df['Age'].fillna(19, inplace=True)

df['City'].fillna("Alexandria", inplace=True)

print(df)

    Name   Age   City
0  Ahmed   NaN    NaN
1   Noha  18.0  Cairo
2   Maha  20.0  Cairo
3   Fady  21.0  Cairo

C:\Users\Admin\AppData\Local\Temp\ipykernel_1644\3200116191.py:12: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(19, inplace=True)
C:\Users\Admin\AppData\Local\Temp\ipykernel_1644\3200116191.py:14: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['City'].fillna("Alexandria", inplace=True)

    Name   Age        City
0  Ahmed  19.0  Alexandria
1   Noha  18.0       Cairo
2   Maha  20.0       Cairo
3   Fady  21.0       Cairo